// import Image from "next/image";

import Header from '../components/Header/Header';
import WhoWeAre from '../components/WhoWeAre/WhoWeAre';
// import Services from './components/Services/Services';
import Advantages from '../components/Advantages/Advantages';
import Footer from '../components/Footer/Footer';
// import FormCalc from './components/FormCalc/FormCalc'
import ThirdPartyFix from '../components/ThirdPartyFix/ThirdPartyFix';
// import RealtimeAdminPanel from './components/RealtimeAdminPanel/RealtimeAdminPanel' //полностью котов к проду купить доступ и выгрузить папку сервера Render.com
export default function Home() {

  const text = `1. Общие положения
1.1. Настоящая Политика обработки персональных данных (далее по тексту – Политика) является неотъемлемой частью договора публичной оферты,
 размещенной на сайте ООО «Транспортная экспедиция Кантар» http://kantar-logistics.ru/. ООО «Транспортная экспедиция Кантар» 
 (далее - Общество) является администратором соответствующего доменного имени в сети Интернет. Используя Сайт, субъект персональных
  данных подтверждает, что он ознакомлен с настоящей политикой конфиденциальности и выражает свое полное согласие с условиями обработки
   персональных данных пользователей сервиса. В случае несогласия субъекта персональных данных с условиями Политики субъект персональных
    данных обязуется не использовать Сайт в качества средства подачи заявки экспедитору.
1.2. Целю Политики является соблюдение прав и законных интересов граждан и положений действующего законодательства при обработке 
персональных данных. Политика принята в целях выполнения Федерального закона № 152-ФЗ от 27.07.2006 «О персональных данных».
1.3. Оператор обработки персональных данных обеспечивает, чтобы объем обрабатываемых персональных данных соответствовал заявленным
 целям обработки. Обрабатываемые персональные данные не должны быть избыточными по отношению к заявленным целям их обработки.
1.4. Принимая условия настоящей Политики субъект персональных данных, в соответствии с частью 1 статьи 18 Федерального закона 
№ 38-ФЗ от 13.03.2006 «О рекламе», даёт своё согласие на получение сообщений сервисного и рекламного характера от Общества.
Сообщениями сервисного характера (сервисными сообщениями) являются сообщения, направляемые на адрес электронной почты, указанный
 субъектом персональных данных, а также через SMS-сообщения и Push-уведомления, мессенджера «Telegram-Bot» на указанный субъектом
  персональных данных номер телефона о событиях, непосредственно связанных с исполнением договоров, а также иные сообщения 
  информационного характера, необходимые для нормального взаимодействия с субъектом персональных данных (клиентом) в рамках 
  исполнения договора.
2. Основные понятия
2.1. В настоящей Политике используются следующие понятия:
персональные данные - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу 
(субъекту персональных данных), которая поступает с сайта http://kantar-logistics.ru/ и иных сервисов; предоставляется при 
использовании  мессенджера «Telegram Bot»;
обработка персональных данных - любое действие (операция) или совокупность действий (операций) с персональными данными, 
совершаемых с использованием средств автоматизации (вычислительной техники) или без их использования, включая сбор, запись, 
систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, 
предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;
распространение персональных данных – действия, направленные на раскрытие персональных данных неопределенному кругу лиц;
предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному 
кругу лиц;
блокирование персональных данных – временное прекращение обработки персональных данных (кроме случаев, если обработка необходима 
для уточнения персональных данных);
уничтожение персональных данных - действия, в результате которых становится невозможным восстановить содержание персональных данных 
в информационной системе персональных данных или в результате которых уничтожаются материальные носители персональных данных;
обезличивание персональных данных - действия, в результате которых становится невозможным без использования дополнительной 
информации определить принадлежность персональных данных конкретному субъекту персональных данных;
клиент - лицо, заключившее с Обществом договор транспортной экспедиции (в том числе посредством сдачи груза к отправке) 
и принявшее на себя обязательство оплатить выполнение транспортно-экспедиционных услуг, оказываемых экспедитором;
сайт – сайт http://kantar-logistics.ru/ предоставляющий различные сервисы, в том числе по оформлению заявки на оказываемые
 услуги удаленно.
3. Цели обработки персональных данных
3.1. Обработка персональных данных Сайтом осуществляется в целях:
идентификации пользователя, использующего Сайт;
заключения и выполнения договоров на оказание транспортно-экспедиторских и складских услуг и услуг по хранению грузов;
осуществления связи с Клиентами для предоставления информации об исполнении Договора, в том числе через  SMS-сообщений и 
направления Push-уведомлений посредством мессенджера «Telegram Bot»;
направления по электронной почте в адрес Клиента (грузополучателя, грузоотправителя, их представителя), сервисных сообщений, 
а также для передачи информационных и рекламных сообщений;
проведения стимулирующих мероприятий и рекламных акций, организуемых Обществом и третьими лицами;
осуществления телефонной связи с Клиентом, в том числе для передачи сервисных и информационных сообщений;
рассмотрения о подготовки ответов на входящие письма (сообщения, уведомления), требующие адресного (персонального) ответа;
передачи персональных данных субъекта персональных данных в страховую организацию в целях организации выплаты страхового возмещения 
выгодоприобретателю;
передачи персональных данных третьей стороне если это требуется в целях выполнения принятых на себя обязательств по договору, 
заключенному между Обществом и Клиентом;
передачи персональных данных в кредитные организации и организации, являющиеся операторами связи, в целях выполнения условий 
договоров и требований законодательства.
4. Виды обрабатываемых персональных данных:
4.1. В Обществе обрабатываются следующие виды персональных данных:
- фамилия, имя, отчество;
- номер телефона, оформленного на физическое лицо;
- адрес электронной почты, принадлежащий физическому лицу;
- паспортные данные (серия, номер и дата выдачи);
- адрес места регистрации;
- данные о банковских счетах.
5. Принципы обработки персональных данных
5.1. Обработка персональных данных на сервисах Сайта осуществляется с соблюдением следующих принципов и правил:
обработка осуществляется на законной и справедливой основе;
обработка ограничивается достижением конкретных и определенных целей;
обработке подлежат персональные данные, отвечающие целям обработки, при обязательном соответствии их объема и содержания 
заявленным целям обработки;
при обработке обеспечиваются точность и достаточность персональных данных, а при необходимости, актуальность по отношению к целям 
обработки с принятием мер по удалению или уточнению неполных или неточных данных;
обрабатываемые персональные данные уничтожаются, либо обезличиваются по достижении целей обработки или в случае утраты 
необходимости в достижении этих целей, если иное не предусмотрено законодательством Российской Федерации.
5.2. При обработке персональных данных Общество соблюдает их конфиденциальность.
6. Права и обязанности субъекта персональных данных
6.1. Субъект персональных данных имеет следующие права и обязанности:
получать полную информацию, касающуюся обработки своих персональных данных, за исключением случаев, предусмотренных 
законодательством Российской Федерации;
требовать уточнения, блокирования или уничтожения своих персональных данных в случае, если персональные данные являются неполными, 
устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки;
отозвать согласие на обработку своих персональных данных, а также изменить согласие на обработку своих персональных данных. 
Субъект персональных данных направляет заявление на отзыв согласия или заявление об изменении согласия на адрес регистрации Общества. 
Субъект персональных данных может направить указанные заявления в форме скан копии на адрес электронной почты kantarlog@mail.ru с 
обязательным последующим направлением оригиналов указанных документов по адресу регистрации;
обновлять и/или дополнять свои предоставленные персональные данные, в случае их дополнения или обновления;
реализовывать иные права и нести иные обязанности, предусмотренные законодательством Российской Федерации.
7. Безопасность обработки персональных данных
7.1. В целях безопасности обработки персональных данных при их обработке используются следующие методы:
ограничение состава сотрудников, имеющих доступ к персональным данным;
ознакомление сотрудников с требованиями действующего законодательства о персональных данных и положениями настоящей Политики;
использование средств защиты информации, отвечающих требованиям действующего законодательства РФ;
иные меры, соответствующие требованиям, предъявляемым действующим законодательством Российской Федерации к защите персональных данных.
8. Организация обработки персональных данных
8.1. В целях реализации прав субъектов персональных данных при обработке их персональных данных:
- принимаются необходимые меры для выполнения обязанностей, предусмотренных законодательством Российской Федерации;
- осуществляется блокирование, уточнение и уничтожение неправомерно обрабатываемых персональных данных, а также прекращение их 
неправомерной обработки;
- предоставляется по просьбе субъекта персональных данных информация, касающаяся обработки его персональных данных, в порядке, 
установленном законодательством Российской Федерации.
8.2. Обработка персональных данных на Сайте осуществляется с помощью средств вычислительной техники (автоматизированная обработка), 
либо при непосредственном участии человека без использования средств вычислительной техники (неавтоматизированная обработка).
8.3. К обработке персональных данных, необходимой им для выполнения своих должностных обязанностей, допускаются работники Общества, 
которые имеют непосредственное отношение к обработке персональных данных.
8.4. Передача персональных данных третьим лицам осуществляется с письменного согласия субъектов персональных данных, за исключением, 
когда это необходимо в целях предупреждения угрозы жизни и здоровью субъектов персональных данных, а также в случаях, установленных 
законодательством Российской Федерации, либо для исполнения принимаемых на себя обязательств по договору с клиентом.
Обработка персональных данных, разрешенных субъектом персональных данных для распространения, осуществляется с соблюдением запретов и 
условий, установленных ст. 10.1 Федерального закона «О персональных данных».
8.5. Передача персональных данных в государственные органы осуществляется в соответствии с требованиями законодательства Российской Федерации.
8.6. При сборе персональных данных сервисы Сайта обеспечивают запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), 
использование, распространение, обезличивание, блокирование, уничтожение персональных данных субъектов персональных данных с использованием 
баз данных, находящихся на территории Российской Федерации.
8.7. Общество вправе передать персональную информацию субъекта персональных данных третьим лицам в следующих случаях:
8.7.1. субъект персональных данных выразил согласие на такие действия. В частности, является безоговорочным выражением согласия на передачу 
Обществом персональных данных (ФИО и контактный телефон) клиента представителю Общества (водителю транспортного средства), выполняющему часть 
функций, входящих в состав обязательств Общества, вытекающих из заключенного между обществом и клиентом договора транспортной-экспедиции;
8.7.2. передача предусмотрена законодательством в рамках установленной законодательством процедуры.
8.8. Сроки хранения персональных данных определяются в соответствии с законодательством Российской Федерации и условиями договора на оказание 
транспортно-экспедиционных услуг, являющегося публичной офертой и размещенного на сайте http://kantar-logistics.ru/
8.9. Обеспечение безопасности персональных данных, в том числе при их обработке в информационных системах, осуществляется в соответствии с 
требованиями законодательства.
8.10. Общество прекращает обработку персональных данных в течение 10 (десяти) рабочих дней с момента получения соответствующего заявления 
от субъекта персональных данных.
8.11. Персональные данные субъекта персональных данных подлежат уничтожению по истечении срока их хранения.
9. Заключительные положения
9.1. Ответственность за нарушение требований законодательства Российской Федерации в области персональных данных определяется в соответствии 
с законодательством Российской Федерации.
9.2. Политика конфиденциальности является общедоступным документом и подлежит размещению на Сайте по адресу http://kantar-logistics.ru/
9.3. Обществом принимаются необходимые технические и организационные меры для защиты персональной информации субъектов персональных данных 
от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных 
действий третьих лиц.`
  return (
    <>
      <ThirdPartyFix />
      {/* <RealtimeAdminPanel /> //полностью котов к проду купить доступ и выгрузить папку сервера Render.com */}
      <Header />

      <div style={{ backgroundColor: "white", margin: "10px", padding: "30px", borderRadius: "30px" }}>
        <h1>ПОЛИТИКА ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h1>
        <p style={{ fontSize: "20px" }}> <pre>
          <code>{text}</code></pre></p>
      </div>

      < Footer />
    </>
  );
}


